{
  "web": [
    {
      "title": "SAMQ E-Learning",
      "slug": "samq-e-learning",
      "type": "web",
      "thumbnail": "samq.webp",
      "description": "A structured e-learning platform with categorized courses, seamless management, and secure multi-payment options.",
      "status": "Private",
      "liveDemo":"https://samq.org/",
      "details": {
        "image1": "SAMQ1.webp",
        "image2": "SAMQ2.webp",
        "image3": "SAMQ3.webp",
        "image4": "SAMQ4.webp",
        "image5": "SAMQ5.webp",
        "date":"Oct 10, 2024",
        "whatIsThisDescription": "SAMQ is an advanced e-learning platform dedicated to improving industrial standards across Africa. It provides specialized training in Quality, Maintenance, Production, and HSE (Health, Safety, and Environment), helping professionals enhance their skills and competitiveness. The platform offers flexible learning options, including self-paced modules, interactive online courses, and in-person training, ensuring accessibility for all users.",
        "whyDescription": "Industries in Africa need high-quality training to maintain excellence in production, compliance, and workplace safety. SAMQ bridges this gap by offering structured, AI-driven learning solutions that empower professionals with the latest industry knowledge. By facilitating skill development through an intuitive platform, SAMQ contributes to a more qualified and innovative workforce, driving long-term industrial growth.",
        "techStack": ["WordPress", "Paypal", "Hostinger"],
        "keyFeatures":"I structured the courses into categories and subcategories for easy navigation, ensuring an optimized learning experience. Using the WordPress dashboard, I efficiently created and managed training programs. A secure payment system was integrated, allowing seamless transactions via PayPal, credit card, and bank transfer. The platform features a professional, modern, and responsive design built with Elementor, providing users with a smooth and intuitive interface.",
        "role":"I designed and developed the entire platform using WordPress. I structured the courses with an organized category and subcategory system, integrated payment modules (PayPal, credit card, bank transfer), and optimized the design to ensure a professional and engaging user experience.",
        "challengesSolutions":"I faced the challenge of designing an admin panel that balances power and ease of use. To address this, I developed an intuitive interface that allows seamless management of courses, categories, and subcategories using specialized WordPress plugins. Another major challenge was implementing a secure and flexible payment system to support multiple payment methods, including PayPal, credit cards, and bank transfers. By integrating reliable payment gateways, I ensured a seamless and secure transaction process. Additionally, optimizing the platform for performance and SEO was crucial to enhancing user experience and visibility, which I achieved through clean code practices and strategic plugin utilization."
      }
    },
    {
      "title": "H2chain Solutions",
      "slug": "h2chain-solutions",
      "type": "web",
      "thumbnail": "smart4technologies.webp",
      "description": "Smart4Technologies delivers H2chain, a software solution for optimizing hydrogen value chains with precision and sustainability.",
      "status": "Private",
      "liveDemo":"https://smart4technologies.com/",
      "details": {
        "image1": "S4T1.webp",
        "image2": "S4T2.webp",
        "image3": "S4T3.webp",
        "image4": "S4T4.webp",
        "image5": "S4T5.webp",
        "date":"July 29, 2024",
        "whatIsThisDescription": "H2chain is a cutting-edge software solution developed by Smart4Technologies to optimize the entire hydrogen value chain, from production and storage to distribution and utilization. This platform enables engineers, project managers, and decision-makers to model, simulate, and optimize hydrogen systems with precision and sustainability. H2chain empowers users to make better decisions by providing data-driven insights while considering environmental impact.",
        "whyDescription": "H2chain stands out as an innovative solution for the rapidly growing hydrogen industry. It offers end-to-end simulations across technical, logistical, and operational aspects of the hydrogen value chain, providing an unparalleled level of optimization. The platform is designed for ease of use, focusing on sustainability by enabling users to analyze carbon footprints and align their projects with clean energy goals. With future features such as AI-powered support and economic tools, H2chain is poised to revolutionize how hydrogen systems are planned and executed.",
        "techStack": ["Node.js", "React.js", "CSS", "HTML", "JS", "Jquery", "Framer Motion", "GSAP"],
        "keyFeatures":"H2chain offers a range of powerful features designed to enhance the user experience. I developed a customizable theme that allows users to switch between light and dark modes, making the platform more accessible. To further engage users, I incorporated smooth animations and a hydrogen-themed particle effect that adds an immersive touch to the interface. Additionally, I built the dashboard, which plays a crucial role in helping users with decision-making by providing them with interactive, data-driven insights. The application is fully responsive, ensuring it works seamlessly across all devices, enabling users to access the platform from anywhere with ease. The contact form is also integrated with email functionality, allowing users to send messages effortlessly, making communication more efficient.",
        "role":"As a Frontend Developer and Designer, I was responsible for building intuitive, responsive interfaces that ensure an optimal user experience across devices. I handled all design aspects, ensuring the website and dashboard were visually appealing while maintaining performance and accessibility. My focus was on creating interactive, data-driven components with seamless functionality.",
        "challengesSolutions":"One of the key challenges was designing an interface that exceeded industry standards for hydrogen platforms. To overcome this, I focused on making the design visually compelling while ensuring it was user-friendly and performance-optimized. For better performance and SEO, I streamlined the code, optimized assets, and ensured all components were lightweight and fast-loading."
      }
    },
    {
      "title": "Taxi Driver Loyalty",
      "slug": "taxi-driver-loyalty",
      "type": "web",
      "thumbnail": "sopetroleapp.webp",
      "description": "An admin system for managing taxi driver loyalty, detecting fraudulent transactions with OCR, and analyzing fuel sales data.",
      "status": "Private",
      "details": {
        "image1": "SOP1.webp",
        "image2": "SOP2.webp",
        "image3": "SOP3.webp",
        "image4": "SOP4.webp",
        "image5": "SOP5.webp",
        "date":"Apr 15, 2024",
        "whatIsThisDescription": "This project is a dashboard designed for Sopetrole, a company that distributes fuel to Shell stations in Laayoune, Morocco. The platform enhances taxi driver loyalty by rewarding them with points for refueling at Shell stations. Additionally, it includes fraud detection using OCR, provides real-time business insights with Power BI, and streamlines fuel transaction management.",
        "whyDescription": "Sopetrole faced a challenge: only 13% of taxi fuel transactions were made at their stations. To increase this share, a loyalty program was implemented, incentivizing taxi drivers with redeemable points for purchases at station shops. Additionally, the system enhances security by detecting fraudulent transactions using Google Cloud Vision OCR. To further improve efficiency, a QR code scanning system was integrated, allowing pompists to add transactions quickly without manual input.",
        "techStack": ["Node.js", "React.js", "Redux", "Express.js", "Python", "FastAPI", "MongoDB Atlas", "OCR", "Power BI"],
        "keyFeatures":"The system includes a Taxi Driver Loyalty Program, allowing drivers to earn points for refueling, which can be redeemed at station shops. To ensure transaction security, fraud detection is implemented using OCR and AI for real-time validation. Dynamic dashboards powered by Power BI provide real-time insights into fuel sales. Additionally, the admin management system enables the addition, updating, and deletion of taxi drivers, supervisors, pompists, and shop supervisors. To streamline operations, a QR code scanning feature allows pompists to quickly register transactions, minimizing manual input time and improving efficiency.",
        "role":"I was responsible for full-stack development, building both the React.js frontend and the Express.js + FastAPI backend. I implemented Google Cloud Vision OCR for fraud detection, integrated Power BI dashboards, designed the MongoDB Atlas database structure, and developed functionalities for managing taxi drivers, supervisors, pompists, and shop supervisors. Additionally, I implemented a QR code scanning feature to streamline fuel transaction processing.",
        "challengesSolutions":"The project faced several key challenges, each addressed with tailored solutions. To increase taxi driver loyalty, a reward system was implemented, encouraging drivers to refuel at Sopetrole stations and redeem points at station shops. To detect fraudulent fuel transactions, Google Cloud Vision OCR was integrated for real-time verification, ensuring transaction authenticity. For real-time fuel sales insights, interactive dashboards using Power BI were developed, providing clear and actionable data. Lastly, to reduce transaction processing time for pompists, a QR code scanning feature was introduced, enabling quick and efficient data entry, minimizing manual workload, and enhancing overall operational efficiency."
      }
    },
    {
      "title": "Sneakers Store",
      "slug": "sneakers-store",
      "type": "web",
      "thumbnail": "ecomapp2.webp",
      "description": "An advanced e-commerce platform offering seamless navigation, dynamic filtering, secure payments, and a responsive experience.",
      "status": "Public",
      "github": "https://github.com/achrafelmakaoui/e_commece",
      "liveDemo": "https://sneakers-eco.netlify.app/",
      "details": {
        "image1": "ECOM1.webp",
        "image2": "ECOM2.webp",
        "image3": "ECOM3.webp",
        "image4": "ECOM4.webp",
        "image5": "ECOM5.webp",
        "date":"Feb 19, 2023",
        "whatIsThisDescription": "This project is a feature-rich online shoe store designed to offer a seamless shopping experience for men, women, and children. The platform provides an intuitive and visually appealing interface, allowing customers to explore a wide variety of footwear, including sports shoes, formal shoes. It is built with a strong focus on usability, performance, and accessibility, ensuring that users can browse products effortlessly across different devices. The website includes advanced filtering and search functionalities, dynamic product variations, and a secure checkout system. With an optimized user experience, this e-commerce solution aims to simplify online shoe shopping while maintaining high performance and scalability.",
        "whyDescription": "The footwear industry is rapidly evolving, and customers expect a fast, convenient, and personalized online shopping experience. This project was developed to meet those expectations by providing a well-organized platform where users can quickly find the perfect pair of shoes using smart search tools, filters, and product recommendations. The ability to change product variations (such as colors and sizes) dynamically enhances the decision-making process. Additionally, the integration of secure payment gateways and order management features ensures a smooth purchasing journey. By combining an elegant design with a powerful backend, this platform stands out as a high-performance e-commerce solution tailored for modern shoppers.",
        "techStack": ["Node.js", "React.js", "Redux", "Stripe", "Express.js", "MongoDB", "MongoDB Atlas", "JWT", "CSS", "Bootstrap"],
        "keyFeatures":"This e-commerce platform includes advanced product search functionality, allowing users to quickly find shoes based on their preferences. A dynamic product variation feature enables customers to change the displayed shoe model based on available colors. To enhance user experience, I implemented smooth animations and a clean, well-structured codebase optimized for performance and SEO. Additionally, a test payment system using Stripe was integrated to simulate transactions, ensuring a secure and seamless checkout process.",
        "role":"As a full-stack developer, I was responsible for both frontend and backend development. On the frontend, I built the user interfaces using React.js and managed state efficiently with Redux. On the backend, I developed the API using Express.js and used MongoDB Atlas as the database solution. Additionally, I handled deployment to ensure smooth operation across different environments.",
        "challengesSolutions":"Challenges: Designing a unique and visually appealing interface for a shoe marketplace while ensuring seamless navigation. Implementing an efficient filtering system, including image-based color filtering, without compromising performance. Solutions: I tackled the design challenge by focusing on a clean and intuitive UI that enhances the shopping experience. For filtering, I optimized backend queries and implemented an efficient image processing technique to detect and sort shoes based on color, ensuring fast and accurate results."
      }
    },
    {
      "title": "Sneakers Dashboard",
      "slug": "sneakers-dashboard",
      "type": "web",
      "thumbnail": "ecomdash.webp",
      "description": "An intuitive and secure admin dashboard for seamless product management, real-time analytics, and efficient operations.",
      "status": "Private",
      "details": {
        "image1": "ECOMDASH1.webp",
        "image2": "ECOMDASH2.webp",
        "image3": "ECOMDASH3.webp",
        "image4": "ECOMDASH4.webp",
        "image5": "ECOMDASH5.webp",
        "date":"Feb 19, 2023",
        "whatIsThisDescription": "The eCommerce Shoe Platform Dashboard is a powerful admin panel designed to manage the entire online store efficiently. It provides a centralized interface where store owners can monitor sales, manage inventory, process orders, track customer activity, and analyze performance metrics. The dashboard ensures smooth backend operations, allowing administrators to make data-driven decisions, optimize stock levels, and enhance customer satisfaction. With an intuitive UI and real-time data updates, it simplifies store management and improves overall business efficiency.",
        "whyDescription": "Managing an eCommerce store requires real-time insights, streamlined operations, and efficient order processing. This dashboard was developed to provide administrators with a comprehensive toolset for handling everything from product listings to customer orders and payments. It enables business owners to track revenue trends, manage discounts, oversee user accounts, and resolve support requests quickly. By integrating data visualization and automated workflows, the dashboard enhances productivity and ensures a seamless shopping experience for customers.",
        "techStack": ["Node.js", "React.js", "Redux", "Stripe", "Express.js", "MongoDB", "MongoDB Atlas", "JWT", "CSS"],
        "keyFeatures":"The dashboard includes a responsive and intuitive interface, allowing administrators to manage the store effortlessly. It features advanced product management tools, enabling easy addition, editing, and removal of products with real-time inventory tracking. Order management is streamlined, allowing admins to process, update, and track orders efficiently. The dashboard also provides customer insights, helping businesses understand user behavior through detailed analytics and reports. A secure authentication system ensures only authorized personnel can access critical data. Additionally, role-based access control allows store managers to assign different permissions to team members, ensuring secure and structured management.",
        "role":"As a full-stack developer, I was responsible for building both the frontend and backend of the dashboard. I designed and developed the admin interface using React.js and Redux for seamless state management. On the backend, I implemented Express.js APIs and structured the database with MongoDB Atlas for scalable data handling. I also integrated JWT authentication for security and Stripe for test payment processing. Additionally, I worked on deploying and optimizing the application to ensure a fast and smooth experience across all devices.",
        "challengesSolutions":"One of the main challenges in developing the dashboard was designing an admin panel that balances power and ease of use. To address this, I created a clean UI/UX with a structured layout, ensuring that administrators could navigate effortlessly and manage operations efficiently. Another significant challenge was implementing an efficient filtering and search system to handle thousands of products. By leveraging MongoDB indexing and optimized queries, I ensured fast and accurate search functionality, allowing administrators to find products quickly. Security was also a major concern, particularly in authentication and data protection. To mitigate risks, I implemented JWT authentication and encrypted passwords using bcrypt, ensuring that sensitive data remained secure. Lastly, integrating real-time analytics for sales tracking and customer insights was crucial for decision-making. By using Chart.js, I provided clear visualizations of key metrics, and I built a backend system that dynamically retrieves and processes sales data, giving administrators up-to-date business insights."
      }
    }
  ],
  "datascience": [
    {
      "title": "Taxi Driver Loyalty",
      "slug": "taxi-driver-loyalty",
      "type": "datascience",
      "thumbnail": "sopetroleapp.webp",
      "description": "An admin system for managing taxi driver loyalty, detecting fraudulent transactions with OCR, and analyzing fuel sales data.",
      "status": "Private",
      "details": {
        "image1": "SOP1.webp",
        "image2": "SOP2.webp",
        "image3": "SOP3.webp",
        "image4": "SOP4.webp",
        "image5": "SOP5.webp",
        "date":"Apr 15, 2024",
        "whatIsThisDescription": "This project is a dashboard designed for Sopetrole, a company that distributes fuel to Shell stations in Laayoune, Morocco. The platform enhances taxi driver loyalty by rewarding them with points for refueling at Shell stations. Additionally, it includes fraud detection using OCR, provides real-time business insights with Power BI, and streamlines fuel transaction management.",
        "whyDescription": "Sopetrole faced a challenge: only 13% of taxi fuel transactions were made at their stations. To increase this share, a loyalty program was implemented, incentivizing taxi drivers with redeemable points for purchases at station shops. Additionally, the system enhances security by detecting fraudulent transactions using Google Cloud Vision OCR. To further improve efficiency, a QR code scanning system was integrated, allowing pompists to add transactions quickly without manual input.",
        "techStack": ["Node.js", "React.js", "Redux", "Express.js", "Python", "FastAPI", "MongoDB Atlas", "OCR", "Power BI"],
        "keyFeatures":"The system includes a Taxi Driver Loyalty Program, allowing drivers to earn points for refueling, which can be redeemed at station shops. To ensure transaction security, fraud detection is implemented using OCR and AI for real-time validation. Dynamic dashboards powered by Power BI provide real-time insights into fuel sales. Additionally, the admin management system enables the addition, updating, and deletion of taxi drivers, supervisors, pompists, and shop supervisors. To streamline operations, a QR code scanning feature allows pompists to quickly register transactions, minimizing manual input time and improving efficiency.",
        "role":"I was responsible for full-stack development, building both the React.js frontend and the Express.js + FastAPI backend. I implemented Google Cloud Vision OCR for fraud detection, integrated Power BI dashboards, designed the MongoDB Atlas database structure, and developed functionalities for managing taxi drivers, supervisors, pompists, and shop supervisors. Additionally, I implemented a QR code scanning feature to streamline fuel transaction processing.",
        "challengesSolutions":"The project faced several key challenges, each addressed with tailored solutions. To increase taxi driver loyalty, a reward system was implemented, encouraging drivers to refuel at Sopetrole stations and redeem points at station shops. To detect fraudulent fuel transactions, Google Cloud Vision OCR was integrated for real-time verification, ensuring transaction authenticity. For real-time fuel sales insights, interactive dashboards using Power BI were developed, providing clear and actionable data. Lastly, to reduce transaction processing time for pompists, a QR code scanning feature was introduced, enabling quick and efficient data entry, minimizing manual workload, and enhancing overall operational efficiency."
      }
    }
  ]
}
